Revit 2026 API

# UVBasisU Property

---

The basis of the U axis.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV BasisU { get; }
```
```vb
Public Shared ReadOnly Property BasisU As UV
	Get
```
```cpp
public:
static property UV^ BasisU {
	UV^ get ();
}
```
```fsharp
static member BasisU : UV with get
```

#### Property Value

UV

The basis of the U axis is the vector (1,0), the unit vector on the U axis.

#### Reference

UV Class

Autodesk.Revit.DB Namespace